Tekla Open API Reference for Tekla Structures 2025
ProfileConversion Methods
The ProfileConversion type exposes the following members.
Methods
Name | Description
ConvertFromCurrentUnits
 Converts a profile string from current units to internal units (set in Units and decimals options).
ConvertToCurrentUnits
 Converts a profile string from internal units to current units (set in Units and decimals options).
Top
See Also
Reference
ProfileConversion Class
Tekla.Structures.Dialog Namespace